app/Http/Controllers/FilmController.php

    public function index($slug = null): View
    {
        $query = $slug ? Category::whereSlug($slug)->firstOrFail()->films() : Film::query();
        $films = $query->withTrashed()->oldest('title')->paginate(5);
---
select * from `films` order by `title` asc limit 5 offset 0
select count(*) as aggregate from `films`