app/Providers/AppServiceProvider.php

select * from `categories`
select * from `actors`
---
    public function boot(): void
    {
        //

        setlocale(LC_TIME, config('app.locale'));

        View::composer(['lessonfilms.index', 'lessonfilms.create', 'lessonfilms.edit'], function($view)
        {
            $view->with('categories', Category::all());
            $view->with('actors', Actor::all());
        });